<?php
// Массив с именами
$a[] = "Андрей";
$a[] = "Михаил";
$a[] = "Айназ";
$a[] = "Игорь";
$a[] = "Григорий";
$a[] = "Лейла";
$a[] = "Станислав";
$a[] = "Анастасия";
$a[] = "Олеся";
$a[] = "Марат";
$a[] = "Константин";
$a[] = "Владислав";
$a[] = "Андрей";
$a[] = "Олег";
$a[] = "Petunia";
$a[] = "Amanda";
$a[] = "Raquel";
$a[] = "Cindy";
$a[] = "Doris";
$a[] = "Eve";
$a[] = "Evita";
$a[] = "Sunniva";
$a[] = "Андрей";
$a[] = "Unni";
$a[] = "Violet";
$a[] = "Liza";
$a[] = "Elizabeth";
$a[] = "Ellen";
$a[] = "Wenche";
$a[] = "Vicky";

// получить параметр q из URL
$q = $_REQUEST["q"];

$hint = "";

// поиск всех подсказок из массива, если $q отличается от ""
if ($q !== "") {
    $q = strtolower($q);
    $len=strlen($q);
    foreach($a as $name) {
        if (stristr($q, substr($name, 0, $len))) {
            if ($hint === "") {
                $hint = $name;
            } else {
                $hint .= ", $name";
            }
        }
    }
}

// Выведите "Нет вариантов" если подсказка не найдена или выведите правильные значения
echo $hint === "" ? "Нет вариантов" : $hint;

